mid-week
1,800
Poetry
Larsen
hanging
Hawaiian\/Japanese
five-nation
comically
localized
Schuster
161.8
161.1
fractioning
161.3
scold
Archuleta
153.3
refunding
Western
2.4375
Rajiv
Euro
Apicella
wracked
stipulate
pigment
appropriation
Fridman
bringing
seamier
Goshen
revelers
liaisons
ASSETS
Cairenes
Amparano
Loeb
virtuosos
woods
Raptopoulos
Multilateral
Tuesday
shows
immunities
non-violent
Pinkerton
Cogeneration
Shocked
270
271
272
273
274
275
sustaining
278
279
Stateswest
errors
world-weary
reopens
Initially
cooking
BLOEDEL
Hamilton
co-venture
designing
AT&T
Agfa
shocks
film-makers
crouch
crooned
zlotys
mailings
5.125
affiliates
lumber-like
non-``
affiliated
confronts
Manger
Manges
kids
35374.22
climbed
Dubose
controversy
404,294
neurologist
spotty
Isler
rebel
golden
projection
Harvey
Spots
lengthen
stern
233,000
Warburgs
frosty
ARTY
Pontiac-Cadillac
2642.64
Vernon
music
therefore
stock-registration
distortions
reasserting
dusting
grounds-care
Diabetes
Glenne
populations
down-to-earth
Clients
5.12
5.13
5.10
5.11
5.16
Sindona
Mattress
circumstances
pay-movie
intake
morally
locked
Warnock
non-advertising
CHEMICAL
Colombia
six-mile
cable-programming
Le
La
unjust
DataQuest
un-advertising
Li
American-style
titanium
want
51.1
automobile-parts
51.3
51.4
Attempts
51.6
absolute
LA
Malapai
travel
Attention
copious
cutback
Navin
45.3
dared
Falcon
oceans
Bates
L.
assimilated
stingier
dinosaurs
wrong
Fogg
sentencing
45.4
Hoping
Charitable
recombination
CFD
CFC
sickening
tulip
18th
point-of-sale
9.192
Retention
Willy
Even
already-shaky
welcomed
Blackstone
dethroned
Asil
Robertson
rewarded
welcomes
H.L.
ex-dividend
His
Hit
fit
Schroeder
screaming
fix
occupations
Kavanagh
Walesa
Rubins
Ciminero
Landry
Galanter
Libera
bristle
Aloe
vouchers
top-quality
effects
14.43
Specialized
14.44
grueling
castigating
Less
wooden
arrow
transit-association
burial
telescope
parasites
393
392
391
currencies
396
395
394
allay
Denizens
pomological
Susie
touts
Underseas
502,000
tax-loss
encourage
adapt
39,400
Inco
Chivas
misrepresentations
Impressionists
stamping
sheetrock
PAYS
wavered
Kristol
corrects
stereotypical
Transformers
estimate
Egg
universally
chlorine
jugs
Pilsudski
competes
Nigel
SISAL
ice-breaker
ministries
disturbed
competed
mendacity
DISCIPLINARY
Krampe
lightened
Basically
reintroduced
Roulac
Gingerly
megabytes
Lurie
seizures
naughtier
olds
LAND
service
needed
master
alleys
genesis
Hammerstein
rewards
Kerr-McGee
mid-June
Gosbank
mutilated
large-size
Oracle
non-interstate
positively
tax-reducing
feasibility
Colleges
SPAN
35-year-old
handcuffs
35.125
regulator
idle
461.9
silky
Zeta
feeling
energy-efficient
also-ran
Chicago
277
Generally
spectrum
35-hour
Dixiecrat
brawny
increment
CORPORATE
sailed
dozen
2.79
Then
wholesome
mostly
Grodnik
2.71
2.70
2.73
2.75
2.74
2.77
2.76
Pascual
They
ex-accountant
Yokohama
concedes
oohs
committing
460.05
diminishing
vexing
cinematic
resonates
metrics
Seib
mouth
Pediatric
conceded
resonated
214.54
proliferate
Mahler
singer
474.1
purges
Paragon
state-directed
Civilized
paneling
photofinishing
Feshbach
purged
custom-die
saying
Bobar
Mignanelli
Jacobson
TAXPAYERS
fennel
Butterfinger
Marks
tempted
cheaply
35.875
Resources
156.8
hi-tech
excavator
kindled
Ammonium
rich
Geste
TEACH
rice
plate
outfielders
Dionne
bruddah
88-points
Bancorp.
currencny
zestfully
Senators
Baden-Wuerttemburg
368.24
nicely
Andover
patch
Rio
Rim
Higher-income
1974-75
twice-daily
programmatic
clarified
sensitivity
196.7
Anderson
196.2
196.1
Boon-Sanwa
alternative
196.8
McChicken
playfulness
lots
Advances
Dartboard
off-price
droves
guided-missile
Chugoku
fez-wearing
ire
Advanced
Hurst
discipline
redistricting
extend
nature
Eisai
optimist
superficial
Bajakian
17.12
extent
Bronx
17.19
tyranny
Elaborating
veer
leisure-oriented
heating
incense
Laura
Handmaid
Wohlstetter
china
southeastern
eradicate
obscenity
SCHWARTZ
Reuter
11.13
11.11
unhealed
fissures
minuses
blonde
truthful
MANY
five-by-eight-inch
3.83
3.80
3.87
3.86
3.85
Sitting
union
Octopus
3.89
fro
cue
.
muck
much
Closely
undistinguished
fry
tallest
Ellman
chlorazepate
doldrums
W.J.
sensitize
retrospect
Clayt
50-story
Consensus
1.1580
Donovan
22-month-old
doubts
business-related
two-hundredths
spin
wildcat
OS\/2
Elgin
cul
dispersant
Beware
bargain-hunters
contingencies
professionally
employ
disk-drive
red-figured
Vlasi
reunion
k
slide-packs
deferring
RODE
27.875
Clarksburg
conditioned
London-based
securitiess
Brookings
noncompetitive
conditioner
verged
breakfast
755.9
hone
13.15
memorial
recover
malefactors
Elders
13.18
Tahitian
split
principals
Wussler
Married
effortlessly
marches
Maybe
qualifications
workforce
displace
marched
Liquidating
boiler
Bentsen
supper
Tracer
midsized
Shicoff
anti-Bork
Martyn
Miami-based
mentors
academic
academia
Yutaka
corporate
massaging
plaque
Shaffer
Rapid
Matsushita-made
haberdashery
appropriately
gun-shy
portrayed
Happy
claudication
Ewing
Oscar
had
insubordination
Connecticut
beloved
vicitims
has
hat
Spence
Legitimate
grilled-chicken
municipal
elders
survival
constrictors
unequivocally
indicative
12:38
Cray-3
clustered
shadow
riskiness
1990-2004
Wedtech
1990-2000
Brenda
1990-2002
Coupled
1990-2009
festivities
Steven
Pentagon
misdemeanors
Swedish
beneficial
disks
crowd
trillion-plus
crown
begin
crows
prospectuses
Avdel
Between
fiduciary
Goodyear
27.125
186,000
Nixdorf
bottom
inhuman
plucked
Lasorda
Watts
Jakes
Calls
binder
brigades
anti-scientific
starring
caskets
Scwhab
54.3
344,354
benches
54.5
517.85
anomalous
bicentennial
directmail
classical-music
lemmings
pre-tax
Concerned
honeymoon
Varo
administer
Aaron
one-fourth
shoots
2,520
appropriators
Ends
fabric
altitude
raped
1701.7
grasping
greatness
Device
GERMANS
miles-per-hour
quota-cheaters
nonvoting
hot-tempered
Boudreau
perfumed
multi-million
Soda
2,750
Bensonhurst
incinerator
Interferon
duel
dark-squared
FiberCom
masquerading
Year-to-date
Jaya
Household
639.9
County
break-up
complications
appeals-court
soldering
Brest
duet
Jays
dispute-settlement
refillable
passenger
disgrace
Sentiment
hysterical
Tales
Deleage
VARIAN
bats
paperwork
tooth
triangles
Tashi
taxable-equivalent
eventual
role
Burke
market-affecting
roll
intend
palms
ointment
outage
transported
Melbourne
intent
Horticultural
variable
transporter
Gardens
explosions
Ida
shootout
80386
overturned
Heerden
5.17
BURNHAM
proficient
chain
whoever
Shigezo
Querecho
chair
heavy-construction
5.19
grapples
Tourist
megawatts
photocopiers
crates
Kimbrough
grappled
Beckwith
macho
oversight
tenacious
Barret
paychecks
Agnos
choice
Barred
gloomy
ghostbusters
stays
plaid-floored
exact
minute
cooks
epic
Tap
reining
14-ship
Tax
cameo
skewed
Tad
Tae
Inexplicably
Move
defaults
CLAIMS
reimpose
1,400,000
M$
Silvio
Twenty-one
trails
Small-company
M.
Dryja
ogles
lengthened
heavyweight
chopping
shirts
M2
6,930,000
Stop-Limit
5,200
celebrated
storability
300
P-5-39
geography
boost
Lopez
unintentionally
Me
drafted
Porsche-like
old-guard
climbs
blunted
Mo
topicality
speculating
Latham
address
dwindling
My
egg-processing
Webb
enroll
Merc
Bork
MC
mafiosi
dusty
procedurally
LME
accomplished
MP
ill-fated
Bofors
12-month
MX
influx
REAL
stockbuilding
237,960,000
Giulio
houseman
Thornton
140.74
Enough
30\/32
self-sufficient
Joni
REAP
Davidson
Heimers
August
working
Watsonville
ARNOLD
districting
opposed
Jaclyn
liberalizing
clanking
Those
thrill
Klaus
hawkish
approving
non-family
consoles
goods
Doubles
riders
ADVANCED
rebounding
51.9
originally
constraint
abortion
Hershey
Laotian
Wetherell
following
renew
reauthorize
Protestantism
admired
mirrors
Hump
Shilling
parachute
locks
incremental
admires
admirer
Dayna
rayon
listens
petroleum-related
Casey
T-bills
sudden
mid-September
3,632
thanking
Sprizzo
750,000
Skinner
Riese
minicomputers
Drain
openers
B-flat
defense-suppression
fueled
laxative
reassessment
Corporate
minisupercomputers
finanicial
Needless
name-calling
regressive
middle-income
swollen
skirmish
wolves
pulled
blowup
wastepaper
Encouraged
gold-based
seven-bedroom
Peterborough
twiggy-looking
Prudence
LIN
O'Dwyer
years
LIT
structuring
episodes
Cromwell
Wetten
disconnect
once-fashionable
Cypress
harassed
troubles
Agencies
95-37
suspension
gold-leaf
troubled
no-brainer
modestly
recipients
civilian
Sammi
ENERGY
out-trade
Deutsche
Gordon
now-standard
Kemp
Webster
U.S.backed
bedevil
aft
24.8
24.9
apologizes
24.4
24.5
24.6
24.7
24.1
24.2
24.3
open-door
dignified
instability
quarter
quartet
materializes
retrieve
bursting
Yoshiaki
presages
receipt
custom-designed
Live
sponsor
entering
gains-tax
prudently
disasters
Deborah
Jiangsu
793
792
791
Michigan
paroxysmal
seriously
trauma
12:48
TIGRs
complicates
21.72
curbs
uptempo
Westpac
incentives
NBC
sonar
inwardly
complicated
constitutionality
bid-wanted
la-la
94,543
Avmark
Ventes
precious-metals
modest
initiate
aboard
Owens
neglect
hemorrhoids
emotion
Norwalk
top-heavy
34996.08
saving
symmetry
spoken
one
Lasker
Pixley
spokes
Sinyard
36-page
stifles
Monday
McInerney
carbide-products
oversimplified
decommissoned
lingering
subcompacts
Omron
1.54
solid-waste
318.79
surges
persuasiveness
snatch
SQUARE
once-closed
specialists
surged
Cordis
History
government-guaranteed
translate
nonsocialist
crossroads
so-so
Hubert
Knowledgeable
wandering
shakeup
illness
Waring
flatly
deposited
turned
locations
jewels
Field
gene-splicing
cold-rolled
double-decking
uninterrupted
borough
fashionable
warriors
Alicia
zoo
intends
Fabulous
Hale
Half
evened
Hall
imperatives
printer
opposite
buffer
squalor
Gilleland
spewing
Darman
buffet
backlogs
Wong
printed
Sochaux
Cher
touchy
second-story
Chez
Chex
jitters
investment-counseling
jittery
redirected
787.02
Chem
LDI
Jeeps
stimulator
coupon-equivalent
infuriate
APMS
Sky
friction
153.93
fecal
sales-tax
elan
inconsistent
104.8
aggressive
imagined
slam-dunk
transact
aimlessly
Adia
Leadership
arbitrage-related
free-trade
gas-derived
guarded
Assets
revolutionized
447.76
balconies
Olean
college-sports
Denied
awaiting
recombinant
Ryosuke
Exhibit
keenly
Disappointing
Facilities
Pawtucket
vision
Old-time
hurricane-wracked
Juge
preclearance
hastened
Clintonville
Worldwide
defensively
830
837
Still
foreign-investment
alarming
838
Rales
sponsorship
vaccines
87.25
kilometer
Jonas
consumer-electronics
moons
Kadane
enjoys
Mitsubishi
mother-in-law
Placement
Harbor
Wachter
Quack
Abbott
Conasupo
Katzenjammer
hunk
bankruptcy-court
awards
LIBERTY
Wachtel
menacing
wickedly
Cosmos
uncharacteristically
concentrated
busting
Automax
Hathaway
Collectors
Luxco
flipped
paring
s
workplace
concentrates
recordings
C-word
gridiron
doctoring
allowance
UMNO
compels
Leavitt
Twenty-First
buoyancy
Horton
Skies
Pepper
87-7
network-buying
A.C.
west
evolutionary
Asheville
motives
Babel
Secured
spyglass
wants
BankAmerica
Weinroth
tightener
formed
readings
photos
tightened
reshufflings
former
Give
straighten
squeezes
straighter
huckstering
newspaper
situation
Same-store
Size
penthouse
engaged
Nagoya
dubious
Primary
electrogalvanized
engages
technology
117.375
verified
electronic-warfare
Replacing
theorized
legalistic
Lovejoy
Kiko
Kiki
Blood
44.875
Bloom
visually
managements
edged
assigns
hideaway
defy
IRS
72-hour
deflate
edges
wired
Clean
IRA
Temper
CNCA
tracking
wane
excused
Mednis
60,000
Non-lawyers
Zero-Based
Racal
May
peculiarities
779.8
Berlitz
Sigmund
Otros
Magellan
Port
1,716
5,810
reconstruction
recycles
being
Diesel
Crossfire
NAM
Scenarios
recycled
Concerns
self-indulgent
Megargel
minimized
Omnicorp
temblor
pillar
grounded
undeveloped
characterization
Bardagy
glutted
Lewala
overthrow
semi-private
Crane
Malec
amalgamations
Debates
gestured
rejoin
takeover-threat
sums
unveil
gestures
traffic
preference
world
postal
1984-85
Seafirst
tremulous
sensational
malfunctions
piston-brake
Electrochemical
superiority
Valiant
militate
obstruct
brushing
seating
superintendent
demeaning
diving
Mouse
Hanifen
Brazilians
368.3
AGA
919
918
914
10.375
well-planned
restoring
squabble
McGinley
retains
Tax-exempts
showgirls
million-gallon
windfalls
leadership
Cawdron
114.4
inflation-adjusted
majoring
Private-sector
Revolution
bio-research
Tibbs
disabilities
hair-care
five-cent
restoration
Agoura
TELESIS
Millions
rabbinical
340B
perturbed
No
antidote
ineffably
Endangered
Attridge
lively
preparer
pivot
450.7
NH
salicylate
NL
rumbled
NO
glean
Beta
Galamian
Peninsula
rumbles
mindless
sealed
F.C
NP
bubble
NU
Stirs
Hannover
Firebird
N.
Thirty-four
emigres
Tandy
Taft
103.1
abating
with
Redevelopment
abused
pull
rush
monopoly
Rodriguez
upper-level
Byrne
eight-count
31.7
31.4
390
31.2
exhaustion
31.1
8.019
56,900
pulp
31.8
PENSION
Beaubien
Porche
gratuitous
379.46
speculations
color-television
thrift-industry
POLITICAL
Airlines
watches
watcher
tragicomic
ensuing
formulation
watched
jargon
AZT
399
Piping
cream
Real
escrowed
moniker
left-leaning
Read
half-completed
bailed
T.D.
120,000
faxes
Theran
643.3
35,000
waving
uterus
25.875
federalized
Kildare
linebackers
tricky
electronic-measuring
Conn.-based
omnibus
tricks
dyed
Specifications
Driesell
Cardillo
Bias
Lyric
dyes
accreted
Hens
industry-government
legislatures
head-to-head
caused
beware
ceramic
unitholders
388.5
assessment
Farley
causes
Galsworthy
taxicab
Schaefer
predawn
Waterbury
gall-bladder
riots
norm
roadway
1,050
4-1
floated
Conversation
Stuttgart-based
24th
mind-numbing
quasi-governmental
Maxtor
sang
sand
Semifinished
small
sank
self-employment
quicker
199
198
Niagara
195
194
197
196
191
190
193
healed
past
displays
pass
McCarty
investment
menswear
clock
Lonesome
hyper-trader
Dutch\/Shell
gouty
computing-services
MEDIA
Ogilvy
jurist
full
Psychologists
Bourses
Charlie
OEL
Huntley
diapers
portrays
daunted
BOARD'S
Roeck
civilians
Spencer
criminality
Bonds
experience
prior
periodic
Reina
free-on-board
cessation
skepticism
Mannesmann
tax-free
depart
retroactive
3:30
Scorpio
Kuwait
traumatized
Richmond
follower
528.56
full-sized
Pitiful
31\/32
Payne
attendance
A-body
Friedrichs
fragrance
59-year-old
single-day
Conlon
more
Teknowledge
Fenn
door
initiated
substances
company
Nguyen
corrected
one-sided
tested
4,900
Celica
doom
Agitato
anxieties
applelike
Gods
patriarch
Revenue-short
learn
knocked
changeover
scramble
Panasonic
generalists
memoirs
meaner
Chao
Wolfson
Glasgow
bonded
brushoff
huge
respective
Vining
statisticians
enlarge
dismissed
Frances
top-selling
hugs
dismisses
sprinkle
trendsetter
19-member
intended
Grains
sympathize
'T-
dyed-in-the-wool
CATFISH
GOULD
low-margin
Complete
abrasives
Dobson
resemble
twisting
11.4
11.5
exclusions
replied
11.7
Pinpoint
sausage-grinder
942,000
peppy
installed
wide-ranging
resorts
paper
Fagenson
signs
smiling
roots
saucy
gentlemen
state-run
Plenitude
revalued
symptoms
Fisheries
bypass
Brussels
sauce
colleague
Lomb
abandons
9.05
gadget
vitro
Lanier
Banker
Ameritech
Curley
coursed
Authority
courses
repayment
Benda
Oswald
shocking
chipping
Darien
reactions
Murai
begged
endings
C.W.
scotched
524.5
advertisers
operation
inquired
lipstick
scoops
16.38
research
enjoyment
truck-parts
Stjernsward
Report
Prof.
occurs
bedlam
Nina
10.72
10.77
suntan
10.75
airway
Serious
10.78
Comvik
definition
pairs
tractor-trailer
flex-time
MGM
sewage
Economist
Reluctant
12.39
12.38
626.3
precautionary
purport
Remains
Dalai
brutally
preservation
sequester
Pareo
Started
avec
swipe
moderately
hallowed
bedridden
Giraffe
calculations
essays
5.99
29.90
Gadhafi
SoundView
interviewed
5.94
707-pence
395,974
Trinen
interviewer
FRANKFURT
Hogg
Cancer
Contra
de-emphasized
fertility-control
Hogs
dismantling
family-oriented
mass-producing
Speculative
12,822,563
guarding
Aztar
Achenbaum
blond
18-to-$19
sell
Founding
Messina
destabilizing
extorted
self
Blackmun
also
recognizing
Foot
Chiat\/Day\/Mojo
CALLED
Recreation
Grais
247.3
raucous
virus
shake-up
Grail
trills
singled
understands
Capitol
arson
seize
Anne-Marie
sometimes
barred
proliferated
cultivating
barren
Portfolio
barrel
Relatively
amusements
bulletin
wording
ambiguities
team-management
American-built
Hal
agonize
blended
Had
Amgen
bookings
Hay
counter-argument
Has
overwhelmed
occupation
wraps
Dunn
neophytes
Premiere
Lederer
189.8
Basf
Base
cassette
Dire
Zen-like
Dirk
annum
indifference
non-wealthy
columns
pleading
superconductors
Garpian
sunny
remedy
distraction
devoured
pleasures
well-off
Surveying
tanker
hyenas
prospectus
rumored
insane
delicately
318
GROUP
815,000
Glacier
312
activists
317
449
315
schmoozing
collectively
professional
overboard
Founders
analog
shower
unrealized
Boheme
sulfurous
Perkin-Elmer
hauteur
thrive
go-go
sparsely
1,520
Tustin
estuarian
hunter-gatherers
NEKOOSA
condoned
444
461.6
Fulton
last
legitimately
19.98
nimble
19.95
19.93
steamed
connection
Wilde
Acapulco
retarded
lash
McEnaney
Wisely
1940-1987
bell
acted
aforethought
Totals
Clyde
adaptation
Peanuts
supercomputers
belt
originators
Carr
Cars
satire
imperfections
suburbs
proprietor
initiation
Boyer
Carl
decades-old
Toshiyuki
Cara
patrolled
Card
Care
combatants
Polly
N.C.
straight-from-the-shoulder
Polls
40-a-share
adaptable
moderation
awake
Sinfonia
pacemaker
Pollo
Harriet
Hiroshima
Michel
index-options
presses
Whisper
expanded
budget
conceit
Markey
pressed
32
Margins
budged
Market
Tarter
53.75
Vizeversa
37
von
waivered
motors
Nuremberg
tell-tale
signal-processing
Jennifer
MAINTENANCE
cuisine
raiders
Norwich
savings-and-loan
86,500
economic-efficiency
U.S.A
Disgusted
behemoths
Keffer
kinked
Gen-Probe
affairs
flooded
Entrepreneurs
cardholders
Raphael
Wieden
Likud
waddles
guerrilla-held
nickname
climb
infamous
Occidental
Kary
delisting
honor
Tastes
Taster
Names
62nd
Karo
Karl
recoverable
Reidy
O.
quick-fix
salvo
detract
299,000
salve
Amtran
Marsh
Myron
no-strike
Undead
reap
anti-intellectual
pinball
parents
Marino
Marina
closedown
dealmakers
Marine
On
PROSPECTS
electromagnets
Ok
Hornaday
emergency
Oh
Of
couple
bureaucrat
wives
oneyear
486.6
486.1
abound
Oy
emergence
Or
ON
OK
spine
OF
pounds
greenback
chorus
individuals
Wiesbaden
decrease
81-year-old
spins
privately
shipments
methods
sewers
crapshoot
bounce
Bourse
greener
Yacos
801.2
microbes
39.75
Frank
measurements
novelty
Witter
52-week
behave
Heublein
Krutchensky
Franz
Aviation
221-person
seclusion
inserting
Hells
Sculley
Liaisons
electronics-instruments
17.92
obscures
17.95
17.97
dissonance
concealed
obscured
Hello
deserved
simplify
deserves
Winnetka
Rican
canning
well-versed
seven-figure
Shaw
Debt-Burdened
terrorists
turboprops
into
Flights
40.50
controversies
contributor
Optical-storage
sightseeing
uncertainties
span
Dime
Brunsdon
gases
280.5
280.7
spas
opens
fragmented
stock-price
year-ago
market-reform
data-storage
deductions
carping
realists
ready-to-eat
considerable
snooping
fades
Consolidated
testaments
Disabilities
maturity
Astor
faded
mortgage-securities
WWOR
Gentility
BetaWest
150.3
squinted
influence
haunt
Vauxhall
globally
diverse
Twins
chat
Sierra
titanate
puzzling
Wilsonian
Phillies
Gephardt
conceptions
Arthurian
revision
49.375
Julius
Testifying
1.2745
1017.69
Macchiarola
suppression
detriment
reinsurance
lane
land
methodologies
Pitman-Moore
time-share
Worthington
Leipzig
scream
6.26
Skipping
6.24
6.25
Stamford
Chicago-Helsinki
6.20
F.E.
Secaucus
modernizing
dawning
toted
guessing
broaden
Jim
Wrighting
Woodrow
broader
amiss
Biogen
507
two-seater
detectives
amalgamation
rejoined
543,000
171.9
Lambda
resources
featherless
unwinding
boatload
quadruples
dissents
petitions
Wheels
quadrupled
minerals
padded
real-estate
harbor
whooping
funneling
fewer
IPOs
129.72
world-class
disheveled
Bankruptcy
593
592
595
597
Spending
598
unprofitable
crook
Wigglesworth
video
dynamics
Breene
victor
Basinger
drought-related
landfill
Schmedel
waning
multimedia
SCUD
turnaround
hounded
flowing
continously
harassing
Freedom
Dupont
Luciano
Spectator
squirming
winnowing
TECHNOLOGY
1,200,000
1932
rehabilitation
1930
survey
derby
makes
maker
1936
7.58
three-story
panicked
Greenwich
7.50
7.51
Tito
7.53
7.54
7.55
7.56
7.57
NASDA
dumbest
nibbling
willies
170,330,000
confidence
employment-tax
property\/casualty
HEARS
Sole
Lobbyist
Siegel
next
assuring
Cadwell
BONO
Sheehy
Arboretum
face-to-face
attractions
BOND
pencil
EURODOLLARS
41.8
41.5
41.4
41.3
41.2
41.1
baby
Blackfriar
customer
integrating
clients
Fiedler
unknowns
Collor
wedge
painstakingly
process
lock
rode
promotional
nears
Democratic-controlled
rods
bolstered
Agricole
educational
Rosie
Agricola
paled
Eldred
hormones
comedy
Friends
pales
Solutions
Westamerica
Nathan
SCRAP
re-entering
STOCKS
upstate
Marlowe
208.7
Sitco
Sanwa
Results
One
Oct.
realizes
Laugh
Nine-month
Madson
13.851
leftfield
understate
thigh
mute
Vicky
altogether
Fitzgerald
Lincoln-Mercury-Merkur
directs
summer-holiday
Campbell-Mithun
perfect
Scientific
Emergency
cut-rate
Brooks
Cabinet
meantime
thieves
stalled
Memories
Brooke
derivative
LYNCH
statutorily
physicians
prosper
Conviction
Wertheimer
Register
mediocre
Devesa
seawater
Extensions
snake
nose-dived
Works
realize
STOCK
disgorgement
car-rental
ruefully
scenic
Riely
Wenceslas
shortage
70-A21
strode
suitors
Bard\/EMS
bump
dipping
resurging
Anniversary
deficiency
books
Cheng
resuscitate
VAX9000
witness
mind-set
fundamentally
'
boutique
73.5
73.6
750th
73.8
incompetence
market-on-close
32-story
Shortly
unwieldy
news-weeklies
234.3
234.5
greedy
leukemia
Monopolies
disintegrating
Exodus
Ecco
modem
two-pronged
mainland
Juliano
gallons
could
chilly
length
ratification
troughed
Calvert
repeats
distinguish
jurists
52%-36
scene
soothing
Refco
landlord-tenant
Krispies
affliction
Ries
vetoed
avert
9.324
Iran
Eastern
ordering
Doosan
880,000
sergeant
vetoes
SHAKE
garden-shrub
16.625
Iraq
consternation
Kikkoman
pervasive
enforcement
vigorous
quarry
72.2
Roosevelt
328.85
state-subsidized
incongruities
Hastings
Newcastle
auditor-general
roulette
1,222
949
1,224
three-bedroom
Existing
110.1
orchestrated
110.4
110.6
110.9
Metromedia-ITT
Tennesse
Negotiable
faulted
false
shrinks
U.S.-supplied
nonworking
cost-reduction
Finsbury
tonight
Secret
Rowe
57-year-old
depict
how-to
Fukuyama
uncalled
Fluor
Bay-area
clarifies
36.87
Pierce
manor
Brown-tobacco
Gumkowski
Fizkultura
foreign-currency
Mode
15.50
35087.38
1,480
1,482
Reserve
so-called
placement
Barasch
bred
program-trading
above-market
consorting
mustache
brew
Abortion
Hasenauer
woolly
Reliance
employee-benefit
greenhouse
attainable
nominally
replaster
taps
jaw
jar
Update
terminal
entities
jam
tape
190.1
riding
190.3
jab
Nightline
pro-selected
315.12
prohibition
Keep
wring
Monday-morning
Rating
five-block
Del.-based
comprising
taxes
Eichner
vying
stuff
618.6
taxed
skimpy
exude
Konner
Brent
strengthened
Heller
lawfully
frame
differentials
Joachim
1,103.11
Pa
Hooker
Linden
luckier
185.1
Nagayama
185.7
destiny
185.5
perversities
Issam
nuclear
PX
Issak
PC
incumbent-protection
Riunite
Harty
Hartt
post-bankruptcy
Stroup
Succasunna
368.70
souvenir
P.
factory-jobs
8.525
38,489
bucked
Circus
whispered
Zurich-based
doorway
award-winning
conclude
roughed
near-term
Ledger
62.04
Featherston
indict
undergraduate
Meadows
falseness
balloonists
6.30
co-hero
Sophisticated
genetic
entitle
Modern
debtholders
Istat
commuter
commutes
moved
coherence
Gossnab
altruism
banish
countermeasures
lecherous
eraser-fitted
OECD
54-year-old
Bethlehem
U.S.-developed
Battle
four-mile
deductible
fielding
Piper
1\/2-foot-tall
less-ambitious
Fuel
passbook
greater
ransom
denial
pangs
Regular
Donbas
high-yielding
unimaginable
ex-employer
innings
high-standard
production-sharing
diplomatically
Decker
meting
yield-management
downtrend
identity
diabetes
audit
non-fortress-like
off
18\/32
patrols
Oil-related
patterns
1.29
1.28
canny
administered
diphtheria
1.22
diversify
1.20
1.27
1.26
1.25
1.24
reefs
newest
237.1
Similarly
288,000
Mother
clocks
monetarist
wed
miscommunication
hot-rolled
Tack
wet
villagers
Verdi
straddling
biologists
falters
Daybreak
gambling
Spendthrift
tick
pier
pies
RESOURCES
affections
benefactor
truculence
Agents
become
surest
Ladenburg
actuarial
six-hour
underwent
Kidder
stress-producing
gymnastics
choosing
flush
G-2
Feldstein
G-7
Meridian
recognition
Warrior
contested
majoritarian
just-in-time
mementos
cutting-tools
passion
Gruntal
Negus
biology
shareholdings
Hemweg
brokering
pressure
torched
half-time
Christian-Democratic
infiltrating
imaginary
SPECIALIZED
homemaker
lifestyle
VOA
debentures
3.84
outshines
ROSS
documentary
swimming
cultivates
high-priced
letters
Somewhere
Glazier
sharpness
Greenville
Schreyer
Yamane
31,000
Wight
HOLIDAY
debenture
terminated
splintered
Sacremento
watchman
Billings
indoctrinated
Exact
public-housing
rhythmic
no-frills
cancer-gene
Contract
Cooke
convenience-food
Healthcare
84.3
84.1
84.7
84.4
tossed
evident
antiviral
adroitly
Terrizzi
wheellike
excitement
placed
12-member
gloated
problem
51.65
Argonne
casuistry
Berkshire
nurses
costumes
INMAC
53.25
1.8667
Darwin
nursed
89-107
compared
Fate
nonetheless
deadly
lately
275,000
compares
details
Corp.
illusion
rebelled
February
repeat
111.2
151.8
gloats
embracing
outlets
ULI
U
multinationals
repeal
exposure
searches
Corps
cost-efficiency
sycophants
torrid
7.375
compete
searched
145.7
tax-exempt
gardens
Ericson
magnetic
Kensington
NYU
Roche
Akerson
nursery
tenuous
2,200
integrity
Indemnity
Silences
onus
lopped
unanimity
Sanraku
Assemblyman
periodicals
invective
Immediate
Tokyu
neighbours
Propylene
manhandled
Greenshields
worth
socalled
alternating
TDK
1,977
Shaughnessy
Pipe
gritty
high-net
Military
micromanage
succumbing
three-month-old
Yearly
investigator
Mutual-fund
roadblock
samurai
vented
notifying
abolishing
acetylene
MANEUVERS
395,000
Whoopee
Conning
Troubled
machines
Trappist
auto-market
stardom
filtration
food-service
Fireman
Avery
offshoots
Mazda
Game
Sally
tie-up
Chairperson
viewings
multifamily
Gorman
spunky
residual
protection
obtained
fireballs
clarify
catch-up
Barabba
KKR
stressed
sequestering
postponed
Riklis
Packaged-goods
water-purification
inequitable
plenum
vapors
Lampoon
Prozac
archaeological
socioeconomic
HOLLYWOOD
bra
Crisco
devastation
plow
Seymour
sweater
coins
ploy
Poughkeepsie
quo
bundled
sweated
separated
Paramount-MCA
bombast
Breeden
conclusions
championships
Chronicles
embargos
Thurmond
Breeder
unraveled
adamant
Normally
blocking
501.61
1991
1990
1993
1992
1995
1994
divorced
1996
1999
1998
Parallel
Milbank
Slated
half-forgotten
era
containment
suppository
hinting
souring
Abe
pollute
flunk
Ralph
impair
indicates
wholesaling
373.80
Honeywell
zero-inflation
22,000
Schenley
RTC-owned
totaled
six-figure
recovery
carriers
provide
nuts
recovers
corporation-socialist
Hindemith
resignation
ladder
pollinating
customs
parry
arch
foundering
complacent
Huard
Farrell
elusive
Anglo-Dutch
alienate
appreciate
purging
quieting
CALL
non-prescription
700-room
Fannie
Colucci
Sagan
forthrightly
Dryden
undetected
12.3
12.2
12.1
12.7
12.6
12.5
innovative
slimmer
12.8
droopy-eyed
democracies
defrauded
110-lawyer
Eward
Drew
production
understated
Argentinian
valor
coffee
Oman
safe
retrial
Keepers
Motion
roommate
reaches
lifelong
Jeep\/Eagle
588,300
reasonably
Beairsto
l
144.35
1.2345
reasonable
Broadcasters
Substituting
feeds
soon-to-be-sold
141.65
141.60
dumping
masseuse
financial-crimes
Budapest
Classroom
publishing-group
Sventek
slew
Brunswig
inadvertently
dearth
Gumucio
living-benefits
Downtown
Cereal
self-important
Meyer
Trivest
disputed
barrier
Galloway
death-sentence
114.63
disputes
enlightened
certified
chortled
baseman
Parade
maniac
Metric
practitioner
AFFLUENT
flawless
AMERICAN
footsteps
JERSEY
U.K.
champs
railroads
lower-emission
doling
another
Manfred
disembark
electronic
Azoff
illustrate
112.625
Clue
tossers
U-turn
takeovers
approximately
mail-sorting
dogs
chanted
190-point
3.13
paltry
nonstrategic
Andersson
wastes
hard-currency
cereal
wasted
anachronisms
anti-missile
Masahiko
guile
peremptory
guilt
historical
lanzador
CENTRUST
Hiltunen
resettable
Arteries
210,000
Zamislov
Lubbock
Cray
sportsmen
Kinnear
pubs
refreshingly
impelled
cadge
Mazowiecki
contents
Q.
Pravda
praising
400.0
400.4
convenient
subjects
7.42
pilgrimage
Emyanitoff
unsecured
conscience
gravy
away-from-home
Artist
indemnification
Lucy
Golomb
immediacy
culminates
Table
assessed
Atchinson
Tbilisi
grave
Luck
Twelve
Ayala
swamp
bracket
aunt
Lidgerwood
forward-rate
148,000
reserve
Fultz
Ridge
ESOP
PAY
Ripples
gigolo
disturbs
value-oriented
spuds
Slater
sleeps
Unocal
panned
four-family
scorekeeping
facades
completes
beer-distribution
gutsy
show-biz
rectangle
191.9
Sass
Fryar
wisecracks
Probing
haunted
Board-listed
downtime
long-format
vividly
2,440
Loud
egalitarianism
runs
wrested
stalwarts
Donoghue
207.4
Agent
191.1
Pearce
rung
165-member
insurgents
191.3
secretary
AEP
9.32
9.33
9.34
9.35
AEW
9.37
dustbin
Caleb
Gorbachev
flashed
AEG
horrendous
discussions
optimum
techniques
draws
intermediate-term
TILT
away
Fifteenth
bracing
arcane
cooperation
drawn
drawl
misguided
shields
disavowed
Domingo
48-month
643.4
handful
A310-300s
rush-hour
flashes
Tarzana
kitchen
Cupertino
climate
psychologists
colorlessness
Sutherland
Soweto
astringency
Mich.
55.59
MOB
disappears
Brink
publicity-seeking
McCammon
41-lawyer
tone
typified
adminstrative
Molokai
mutations
advancement
tons
Ireland
tony
telecommunications
gratitude
Kerry
German-built
161.5
Hungarians
Dedication
Schweppes
lockup
Recruiter
superpowers
Spiegel
attacked
Elections
attacker
Norcross
747.7
imbroglio
novitiates
747.8
semi-annually
gracious
Heinz
MacNamara
Lvovna
Hoot
thrash
Ascii
Hood
cylinder
cons
Amfac
Athens
1,656,870
CVN
tissue
teutonic
hairspray
Convention
idosyncratic
Athena
canvases
bilious
soldier
Defuse
Stop
Ill.
PAYMENTS
carrier-based
disciplining
wheel
sporty
co-produce
Denver-based
hang
counterparts
hand
liberties
fuse
Salvation
self-regulatory
whereby
92.42
Flippo
Border
humble
Beef
client
Subcommittee
R.W.
4.060
Portland
sidewalks
4.065
musical
pronouncements
compaction
four-member
uniquely
87.026
Duff
Konopnicki
Cambodia
mid
Lorenzo
thanks
8.15
8.14
8.17
8.16
8.11
8.10
electronically
8.12
similarities
High-Yield
Utilization
in-law
shout
trampled
openings
Hubble
insensitive
Restaurant
supermainframe
six-footer
mail-order
Jansen
Intercepting
designers
Lancet
Wine
eroded
hogs
cooler
Certain
erodes
night
84.75
fluoride
Pinick
mazes
studiousness
add-on
fine-arts
Commission
Rewarding
hassle
flatten
bore
confusing
congratulate
Malibu
house-painting
Cullinet
Ohio-based
asking
participation
peek
field-crop-seeds
dolce
Gras
Neal
Scientology
Proceedings
18th-century
architectural
substitution
peer
peep
Been
breaded
Caere
gentler
Briarcliff
Dragging
unabatingly
wasting
profession
attorney
rendering
184.9
stumble
Richfield
21.5
21.4
21.7
21.6
21.1
21.3
connote
21.9
21.8
Regency
conservation
Matanky
wrongdoing
Literally
Irish
Money-making
gaseous
diligence
McChesney
Bhagat
ceded
garages
454.86
catalyst
low-lying
human-generated
hourlong
2210
reproductive
captive
McGraw-Hill
45.50
human-resources
maximum
hangar
coverings
faking
Reducing
hotlines
request
NUMBER
Quill\/William
guessed
expertise
potholes
prayer
Norton
Stuecker
Tigrean
Banca
senatorial
Falls
65,200
test
immune-system
o'clock
mulling
Wilmington
update
improvisation
Trial
Stolzman
Triad
half-brother
Redwood
Montgolfier
pork-barrel
Concurrence
Passaic
cohesion
accolade
flag-burner
Keller
Chicken
Kelley
holdouts
songs
concept
diplomacy
redeployment
Clifford
supplement
Republic
battle
p.m.
layers
cross-blending
zeroing
Burk
Burt
aristocratic
dissatisfied
Burr
island-fantasy
4\/4
22,750,000
Prego
So-called
graphite-plastic
automobiles
Elaine
10-year
airing
evaded
flammable
redfish
turns
gun
gum
Mateo
90-foot
evades
gut
guy
jurisdictional
CML
verifiable
Mevacor
low-yielding
409,000
Galoob
cost
populating
forging
72-a-share
Ziff
CMS
310.9
rapist
Form
shares
Ford
Chronicle
shared
Sportdom
cynically
Fort
foreign-debt
socioeconomically
Darin
inspiring
Shulman
2:30
Colodny
English
Distribution
Lorin
teaches
teacher
3:25
sending
R.L.
Corvette
oilfield
lithotripter
Fueling
Percy
Israeli-occupied
bangs
439
435
432
433
430
plotted
regardless
extra
uphill
softy
Tillinghast
Isaac
Lawmakers
angle
Scopes
Customers
Dies
Diet
symbolizes
wonderfully
symbolized
Died
Teleflora
Watchers
Require
Canelo
state-funded
non-member
UFOs
spaceships
prepay
Sneaker
decked
defeats
tax-evasion
COHERENT
purge
radar-eluding
HDTVs
commemorate
Throughout
mild-mannered
142.4
Livermore
Clough
1,642
chip
Showa
chit
Pizzo
chin
ERC
chic
MPI
occur
Pizza
142.2
dialysis
Brightman
discussion
spreads
giveaways
615,000
lounge
unrealistically
47-year-old
Rebel
economy
armies
product
Biaggi
peerless
escalate
APARTHEID
push-up
disgusted
Skopbank
produce
Martin
drastic
Model
Shin
noses
grandson
HUDSON
5.625
Radio
Manley
sublicense
pulchritude
4,348
serving
Jay
Fed
ledger
Jan
ended
Boulevard
Cassell
Industriale
Industriali
still
Mandela
Dolan
RV
Enserch
foresees
top-10
DELIGHT
big-souled
RA
a.k.a
factual
Arkansas-based
correspondence
nod
non-dischargable
thermometers
introduce
55,000
Ventspils
slacks
wealthy
not
R.
now
nor
Valdez
placate
Few
Geoffrie
drop
S.G.
beings
22.2
22.3
22.1
22.6
22.4
22.5
Agricultural
22.8
22.9
unloaded
consummated
wrestlers
Gaffney
prompted
challenged
mixed-up
Museum
spittle
Legal
challenges
soy
polices
replay
376.80
year
naming
monitors
Seattle-based
bullish
61.41
furthermore
thirst
Mazzone
Norwegian
financial-planning
Vass
Tariff
first-phase
Arrested
divergence
diagnostic
advantages
repayable
contemplation
right-to-life
idiocy
Travelers
Kroger
transition
519
518
tangled
Erik
invitation
511
569,000
outcry
Padget
515
Eric
517
516
blind
Verret
constantly
Keteyian
flipping
blink
TRAVELS
Till
247,000
cardiac-drug
Syria
Medicine
ring
tame
L.L.
tomorrow
108.2
108.3
108.1
108.6
108.4
108.8
reinvestment
remotely
suvivors
co-authored
typographical
Roach
Response
63-year-old
uninformed
brains
appreciates
repossess
'70s
Refining
junkyard
heretical
interbank
titans
Karstadt
professionals
underwritten
relocating
Creator
transferred
on-line
overhang
Volland
overcollateralized
extinguish
Settlement
Saigon
unsubstantiated
overdosing
Marcos
424.3
bugs
Winnipeg
CALIFORNIA
Petre
Faulkner
APPROVED
12,915,000
lesser-developed-country
Delegates
equipment
Ochoa
chemical-weapons
metabolized
Off
Unlike
attractiveness
neatly
thesaurus
backslapping
importantly
Viatech
Akio
170.6
Reprinted
MeraBank
Ente
customer-service
attempting
steady
premiered
7:30
3.72
3.73
3.71
3.76
3.74
3.75
Character
Domenici
discovered
cathode-ray
Chandross
Wet
Oversight
Woman
Worse
stair
downturns
106.6
106.7
industrialize
ALCEE
106.2
staid
Worst
pollsters
stain
respectable
interstate
Luther
Pepsi-Cola
wardens
crevasses
fantasize
'til
Levinson
humbled
15-a-share
stroll
rippling
Intellectual
reprints
Gottschalk
anti-tax
452.23
Pritzker
Ba-2
Ba-3
1,810,700
Chicago-area
EMC
burst
excoriated
color-coding
actively
Harbanse
EMS
staffed
80-page
91-23
brace
glaze
cotton-growing
Renoir
staffer
Christies
Members
unanimous
therapies
monarchy
pesos
ENGRAPH
Lieberman
handpicked
smashed
hurts
Courant
moans
money-transfer
Biggest
Malaysia
33.875
Lavery
Olav
leathers
impediments
madness
attache
hybrids
Krishnaswami
jeans
Sachs
inexplicable
exploit
Islands
biographer
charismatic
sledding
amino
GenProbe
Meteorological
scrimping
char-grilled
tropical
159
Floyd
dictator
Doctors
Ahlerich
840.8
Maybelline
krona
impugn
guideposts
straying
monsieur
discontinuing
Involved
effluent
suspected
Vincent
skiers
Pertamina
scarfing
financial-service
164.78-point
offbeat
blinkers
burnishing
post-war
fume-filled
near-monopolies
1.2795
GNP
bickered
metric
skittishness
Better
Unwilling
Israel
develop
ONE-DAY
pillowcases
inquiry
Amado
Publicly
squatted
meteorological
foam
252.5
nonlethal
Businessmen
unasked
unread
8086
irresistable
Peruvian
Budweiser
83,950
8088
hand-sized
congressmen
alleviate
SDI
ADVERTISING
taxi
Swaine
livestock
Service
neon
moviestar
Gases
glitterati
foot
Pump
inflammatory
towering
Amusing
death
Linear
Showing
Muniak
verse
1,400
versa
verso
overbought
lowest-cost
Analyst
disproportionate
overruling
swim
propped
laundering
Outflows
swig
0.59
earnest
ramshackle
0.51
stunt
0.53
56.4
0.55
self-tilth
0.57
502.1
fortune
heightened
Soybeans
conducts
rose-gold
Executions
annually
feckless
BioSciences
Suns
output
twelve
verbal
apartments
tragedies
cathode
Walnut
Lederberg
E
medium-size
Hoses
Checchi
unlocked
1850
two-minute
Earlier
honorarium
Rifkin
Pompey
Minerals
rationalizations
Chilean
assembly
sixth
FT-SE
sweet-natured
innocence
assemble
exciting
Leonardo
Kalmus
Beadleston
abortion-rights
Cavenee
ideology
Blaine
Chevron
D&B
backup
Centers
LTCB
freeing
outlook
33.1
33.2
33.3
smelling
33.9
shrinking
entrust
intervention
discount-coupon
shags
Horwitz
qualifying
456.4
456.2
stark
Rounding-off
start
gaze
stars
allergic
471.6
smuggling
pitcher
pitches
American-developed
philosophers
manipulative
know-how
recouped
two-thirds
fastened
pitched
Original
fraud
embedded
default
nonchlorinated
Xidex
big-league
Marston
Fitzwater
realigned
Moves
605
15-fold
intents
600
603
602
beamed
Jacques-Francois
Ferdinand
rosarians
Veterans
evens
Nos.
Howson-Algraphy
cabinets
Annex
tap-tap
inactivation
Minella
housework
terminating
Swedish-Swiss
Lantz
forcing
poor
Gulag
14,099
diaries
36.25
endeavors
whistling
poof
conferred
Miron
dabble
Fossan
basements
plastic-bodied
renegotiating
stockpile
York-Moscow
cores
overseas
Magnolias
Letting
superefficient
ceases
Unknown
HURRICANE
48-year-old
month
heavy-water
ceased
thoughtful
unblock
Take
Shultz
bulb
pipsqueak
religious
bookers
S&P-500
corps
pledged
stripped-down
insulate
music-publishing
fountain
pledges
twothirds
resounding
Steidtmann
clean-air
Hancock
witching
DeBakey
decide
1.23-a-pound
information-systems
lira
Veiling
fusillade
reaffirming
streets
GUN
less-conservative
Watchmen
Youngberg
1989-1990
hamper
5,900
ails
Korea
cues
investing
Paribas
lurch
steadying
61.875
learned
stockyards
Chessman
Paramus
Zulu
tracks
uneven
kronor
excess
Nahas
nine-point
conviction
outgrowth
inspired
losses
Dole
Interprovincial
air-freight-forwarding
advertising
Gurtz
sealing
diagramming
Joan
1,435
gun-carrying
Castaneda
Yemma
ask
S.
somersaulting
Fines
S$
conventional
heartened
incorrect
savored
almost
bash
PRESIDENT
oil-field
lowering
lineups
fast-food
fusses
Sr
grimly
outpatient
St
Banking
Three-month
So
475.35
coup-planning
2,490
2,888,000
Afterwards
PUTS
high-net-worth
SS
Tourism
consortia
budgets
SA
brain-wave
self-conscious
Tierney
Bitten
Caspar
persists
IBM
746
747
748
749
publicist
black-draped
quartets
Innocent
phrase
25.12
tainted-meat
utilize
surpassed
unlucky
Pre-College
Fall
99.85
Television
Emirates
Yield
heartbeat
Viacom
Ameron
Sumat
criticize
bastions
Slote
embark
anytime
Weakening
Myrtle
Marathon
rationality
world-affairs
groundup
remnants
Cholet
international\/diversified
charities
Southbrook
Midler
thermal
BE
less-binding
Atlas
clarinet
Property-tax
Accountants
Petrochemical
liquefies
wishful
mites
ever-growing
absence
systems
founders
Tupolev
Inada
evening
cable-television
Intergroup
worthier
Postel
flatout
terrain
11,429,243
permissible
GAF
Hellman
518.7
142.75
142.70
liquefied
450,000
therapists
bless
disdaining
2233.9
predators
fairy
obligated
groundball
Afghans
restless
Organized
Westridge
punitive
bilges
Isoda
Fearon
KSI
anarchy
Fromstein
3411.08
nonvirulent
TESTS
Callender
522.3
461,539,056
Nikons
testify
veering
equate
safety
7
Prudential-Bache
Town
None
Storyboard
earns
housed
favored
toiling
PROPOSALS
houses
brightest
overshadowing
leapfrog
hapless
loads
chemical-industry
1772.1
390,000
1772.6
Fill-Or-Kill
broad-based
Nature
Bros
Grover
427,300
monetary-stroke-military
Willis
CNBC
drooling
spitting
watchdogs
Resolving
airborne
Swavely
visions
occurrence
horse
domestic-made
troughs
Zombie
station
Money-fund
hindered
Emancipation
hundred
Refuge
167.7
trapped
Molotov
eerily
Purloined
389.6
boredom
1911
Fried
74.35
1914
grew
self-awareness
imperiled
state-owned
Korn\/Ferry
wife\/mother
hesitating
nevertheless
breadbasket
long-suffering
70-30
toward
procedural
Beretta
880
Caroline
886
884
footnote
16.66
Mizuno
heaviest
overstate
randomly
3.625
perestroika
Fortney
Penn
organs
part-owner
Penh
boorish
Price
Focusing
audio-specialty
291.6
aired
hires
Lucinda
Chief
hired
Gorenstein
Kessler
unbeknownst
Papermils
Schweitzer
Total
sturdy
Usinor
arising
divestiture
part-time
bottom-line
velocity
unwed
rechargeable
physics
stalked
one-eighth
phenomenon
hovered
gas-tax
Johannesburg
heavens
Parkway
distressing
flattery
Redmond
justice
ratify
French
Dorena
vomica
consumer-price
Norment
Michelle
grocery
feels
Eaton
pretending
competing
combinations
squeaky
caseloads
imitating
remarketings
Maxima
Boulet
Francis
celebrates
chiefly
11-member
retaliation
8.88
stored
after-hours
hype
buyings
Guides
signatures
Rochester
Franco
Md
locale
15.64
France
culture
drenching
Centronics
Annualized
mediators
close
Mame
locals
colonialists
Messinger
pictures
tolls
Realty
pictured
Leninskoye
Rodolfo
Davis\/Zweig
stagnation
Isabella
Rippe
missing
Ohioan
spray
ranked
B.C.-based
abruptly
league
collaborators
Vadas
Kochis
cashing
higher-cost
drug-store
minorities
Steve
forgotten
vault
experimental
mausoleum
SHEDDING
Compaq
expendable
Koerner
polysilicon
Mr
solvency
unfolded
Educator
Polymerix
Bracknell
44.08
Protection
threaten
Bogdan
instructing
empty
Gingrich
Czechoslovaks
test-tube
lived
Ballard
Hallmark
N
Broadcasting
lives
Donna
Hassan
Sumner
pact
floating-point
intriguing
3,102,935
Garner
pace
ought
Asmara
political-action
characteristically
guide
LifeSavers
pack
64-inch
costly
Thierry
wagering
60,000-odd
industrial-product
payers
Bonwit
Eyes
Esther
mulitiplier
grant
snowbirds
makeshift
Extraordinary
paid-up
sensual
grand
well-hit
Phyllis
Lonski
composition
pleadings
Faith
classmates
lie
banter
indispensability
youngsters
specialty-chemicals
Bleus
elapsed
multisided
ingenious
Lupel
obviously
calibrated
consistency
Schwinn
Living
exploits
shivering
settlements
technicians
reviewed
devastatingly
Tyler
Falconbridge
0.0002
Usery
814,000
112,000
informal
shortcut
cherries
excavators
questioned
Commodore
Krys
PIR
Spouse
double-hamburger
99.35
Graphic
showing
cruise-ship
wonderbars
Galileo
dearly
200.70
36.125
ponds
vests
success
envisioned
Keynesian
DELAYS
eel
vibrant
popular
softness
LABORATORIES
Charlene
cones
flu-like
Hyman
lips
economic
Midwestern
Laos
AMI
Dooling
SPRUCING
dilapidated
simmer
quote
fiddling
AMR
AMT
MassMutual
Southport
Protestant
Economics
undergone
MacMillan
assists
41.75
negatives
41.76
teen-agers
Plaintiffs
smothered
offside
34.25
BUYERS
Taylor
Nouveaux
438,845
silver-conspiracy
Buell
geosciences
silence
Stark
Baron
hounding
85.8
85.7
Teamsters
a.m.-1:30
Ouedraogo
reworked
Boulder
Norman
placing
Called
abate
Koch
maneuverings
Benackova
eons
Rima
withholding
8,590
weddings
tragically
Howe
injection
investment-banking
Tosco
L'Oreal
COOPERATION
Metatrace
Woodward
vacancies
limpid
lords
MacroChem
munis
similar
Brachfeld
hesitantly
broadened
ordered
Lauder
Ty
Tu
Aviv
To
Edward
1,848,000
Avis
three-to-five-year
outbidding
Spanish-language
amounts
dashed
fears
feedlots
application
Wash.
TI
department
Versicherung
TB
QE
arithmetic
TA
Customer
smiles
venerable
Stanford
Median
Crippling
T.
Sentra
smiled
Dauchy
Henley
calculation
e
Uzi
navy
turbines
orbit
Perches
bribe
Soviets
infringing
Apparently
Herrera
Westburne
Lafontant
Boccone
Starr
Valhi
wall-paneling
compact
birthplace
cotton-ginning
668
Nob
uninformative
anti-communist
Not
Nov
Now
friendly
Nor
Stress
Celebrity
Tank
wave
Telephones
rattling
telling
Camry
Shostakovich
Acquisition
nausea
Embryo
Charlotte
No.
positions
watered
self-starting
8.95
Mogul
8.96
coolants
8.99
enforce
hyped
rationalizing
Index
facilitating
Laughlin
SEAQ
FHLBB
thinly
jump
redone
Camera
muffs
fact-bound
notwithstanding
Ishiguro
lipid
building-products
waitress
123,000
unilateral
anti-party
Kutney
Isacsson
Nalcor
75.25
Kristin
Grid
Survived
Copiague
Hibler
Nishiki
anti-lock
kidnapper
KHAD\/WAD
radicals
Locker
Published
non-dairy-creamer
enterprising
kidnapped
convert
Palace
Tequila
Back
Bach
working-girl
avaricious
4,600
gene
salvation
patents
Blake
foresee
although
manage
Pankyo
Contributing
4.76
4.75
4.74
all-white
4.70
buildup
camera
7.145
historically
Png
prior-notice
compatriot
formally
Markus
quicksand
visibility
charming
Kumagai-Gumi
Oakar
43.5
43.7
43.6
rivalry
appointed
43.3
socket
blithely
computer-products
lapse
averaged
postmarked
frogmen
recession
Generation
Symphony
Birmingham
servants
meet
averages
certainty
239
366.79
Israeli
unanticipated
links
money-losing
radioing
Mr.
pulling
sought
Merchant
Aegon
nary
defective
despairs
stole
unseated
Passaic-Clifton
sentiments
232
instinctively
Happened
MiniScribe
Lionel
fare
Tymnet
farm
outdid
thunderstorm
Roman
fouled
dalliances
Allow
97-1
Dupuy
bloodstream
1,384,119
famous
Makin
Ploys
Guard
Arrangements
encyclopedic
PENCILS
anti-toxic
10:45
including
costume
1.80
carnivores
398.3
box-office
temporal
Baxley
40-megabyte
Torstar
Labouisse
frontal
T-1600
functional
J.E.
Venus
Zupan
overcharges
101.225
REACTOR
Antonia
university
Montpelier
slide
brassieres
Specter
prevailing
3\/16
ankles
Statistics
female
Bertrand
witha
LOCKHEED
pursuits
constitute
collegial
investigative
Oils
separating
bloodletting
special
Loral
Loran
21.50
entertainment
CEO
5,440
federal-systems
special-projects
cause
Troutman
contemporize
Malkovich
undated
galaxies
delegates
R.D.
darkly
non-Cocom
cleansers
improvisational
hobbled
232.6
232.4
Rodgers
blunders
resumed
144.9
Murasawa
Owen
timer
times
Telxon
Michelangelos
confrontations
cash-hungry
resumes
timed
Lustgarten
pre-split
Iaciofano
crams
powerful
unsupported
Peripherals
bitch
clearinghouse
140.106
Shane
tinkering
inasmuch
Dunker
Korps
goings-on
hard-nosed
575,000
Ferron
Dawkins
ground-based
Vidunas
lists
chemicals
Rosenbach
RESEARCHERS
Geary
catered
manning
conscious
submitted
Macmillan
caterer
Sovran
243,677
enforced
globalists
sweeteners
Flying
horrors
14.31
Other
enforces
EVEREX
loss-recovery
Administrator
similar-sized
media-stock
Bowers
minimill
Batman
luxury-car
battles
relatives
grounding
auto-emissions
battled
Cadbury-Schweppes
Nokomis
mountaintop
blades
duels
Photonics
vengeance
Geographic
intrinsic
gallery
triple-A-rated
Bertolotti
subtracted
8.25
Fellow
astonishing
8.27
8.20
constrain
Minato-Mirai
halting
Randy
beatific
carcinogen
Adopting
unfinished
brouhaha
marine-shipping
receptors
8.29
Part
inherited
mortality
outsized
Holtzman
Fitness
plunking
second-half
SIMPLIFYING
dwellings
professors
Forget
tobacco
CANADIAN
25.125
imperious
French-speaking
yearn
tuned
FAILED
Palisades
Darlington
tunes
Austrian
Kacy
stock-repurchase
widow
Levine
Investing
shrouded
Seng
immigrant
officials
reinforcements
Uninhibited
raiser
2,822,000
operated
Fighter
intercorporate
all-employee
reverse-engineering
washable
Wisconsin
notoriously
N.H.
nightmare
tend
Kingsbridge
tens
curtains
tent
tore
Sen.
Magnin
laid-off
interfere
rope
Projecting
key
one-stop
2.40
WINSTON-SALEM
hits
2.43
2.44
2.45
limits
2.48
2.49
McGillicuddy
computer-distributed
one-size-fits-all
Burger
Quebec
nontoxic
auto-maker
36.625
diplomats
8,930,000
Amoco
tastier
Bockris
Jaap
TransTechnology
ANTHEM
unaffordable
thanked
cent
immense
liberals
Mansfield
Leuzzi
4,440
shoulders
controlled
constitutes
retrospective
anti-pocketbook
Steinbach
Wellington
guerrillas
controller
abortions
smoking
reclassified
Consequently
Type-O
Blandon
debtor
58.6
58.3
58.2
monohull
58.9
58.8
Atlantans
4,199
dynamism
Kaisha
comets
margin-calls
examines
examiner
191.75
surface
486.30
examined
5.52
Rhoads
BENEFITS
5.50
coals-to-Newcastle
Cottrell
computer-aided
Bangkok
plume
parts
speaker
northwest
Syse
party
divvying
Buzzy
Aluminum
abounds
impeccable
steals
destruction
rift
scarcely
EBPI
Evelyn
Tide
Experiments
standing-room-only
furriers
reinvigoration
drilling
advertises
spy-chaser
45
215.48
discord
increasingly
oak
art-acquisition
TIP
Certainly
215.42
235.5
14.1
distant
sorted
Versicherungs
reckoning
Bellevue
density
pin-pointed
17.20
large-scale
120-megabyte
FACING
Zane
emblems
nationals
ecologically
riverside
balloons
indignation
precedents
terrain-marring
disappearance
Hibben
propelled
Limit
Nelson
bottoms
Amerman
intersection
HK$
loss
hard-boiled
necessary
Aug.
lost
88.7
88.5
Bowman
88.3
88.1
gangsters
300-a-share
payments
conscripts
lose
broad-scale
rote
climbers
revisits
glare
Mayan
near-panic
Leventhal
U.
Yellow
trucker
home
thin-walled
leery
steels
Kong-based
FOES
telexes
pinpoint
near-record
steaming
demonstrates
objected
Newell
overlap
non-dual
cradle
mutation
Toronto-area
sweepstakes
fanny
demonstrated
limitations
reaching
Official
Up
Us
one-issue
non-lethal
90,000
cropping
refuge
uniramous
unhinged
Mental
Amstrad
STAGED
UP
US
greening
Conspiracy
UH
UK
13.25
13.27
13.26
informally
contending
CB-radio-style
previously
stalling
cocoa
ultrasound
Internal
restatement
pointless
additional
lagged
Stripes
slow-motion
Souza
SsangYong
proclamations
crushing
north
Moss
ice-baggers
fountains
blaming
Chamber
strawberries
gain
lowest-rated
U.S.S.R
highest
25-year-old
Kinnock
86.3
skill-dilution
Twist
delights
catalog-clothing-merchandiser
Honecker
display
urging
marketplace
147.5
universal
147.6
Nghe
compromises
beats
foreign-trading
education
Lubyanka
functions
Geneva
ingredients
RULES
Jr.
Aoyama
Never
VA
Wells
Delivery
Giles
workdays
stat
pussy-willow
star
Dual
traditionalist
Mongan
stay
foil
backstage
additionally
Novato
in-office
157.8
Ungermann-Bass
1210.70
Rome-based
Universal-Rundle
indirectly
eclipsing
unimaginative
Frontier
Toubro
2,010
circumlocution
clean-up
Energieproduktiebedrijf
aides
consists
undersecretary
Cuauhtemoc
Soap
buddy
SKr29
tremors
260.5
Honda
disability
pensions
Scottsdale
Shapovalov
painters
swat
unionized
bays
Kinji
swap
Thurgood
offending
recycle
sorry
Dougherty
Francesco
collaborate
light-wave
Dealing
void
McKinnon
Quackenbush
referrals
Temple
Pressed
Article
voir
24-a-share
Shapiro
hurricane-stricken
crops
grandmotherly
unrelated
enhance
unifying
deplorable
whirlwind
landlords
69,980
stocked
2009-2011
Christic
Christie
Yasuda
likely
tangential
subordinate
bureacratic
kidnap
appetite
Bookings
Arizona
21.71
ignominiously
Sikes
hairdresser
WELLS
spokesman
foodstuffs
reviving
niche
back-on-terra-firma
AMONG
men
disposable
680.6
Two-income
met
Bussieres
1.15
provisioning
Aalseth
rooster-comb
Provigo
contraction
premium-beer
Knudsen
prattle
Beltway
bumps
